<!-- terraform-plan-comment -->
# Terraform Plan Results

**9 change(s):** 6 to create, 3 to update, 0 to replace, 0 to destroy

**⚠️ Resources will be modified**

## Resources to create:
- `databricks_grants.mart_schemas["analytics"]`
- `databricks_grants.models_mban_schema`
- `databricks_group.mart_readers_account["analytics"]`
- `databricks_group_member.genie_slack_bot_in_genie_civics`
- `databricks_mws_permission_assignment.mart_readers["analytics"]`
- `databricks_schema.models_mban`

## Resources to update:
- `databricks_grants.catalog_main`
- `databricks_permissions.sql_warehouse_starter`
- `databricks_schema.marts["analytics"]`

<details>
<summary>Show diff</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # databricks_grants.catalog_main will be updated in-place
  ~ resource "databricks_grants" "catalog_main" {
        id      = "catalog/goodparty_data_catalog"
        # (1 unchanged attribute hidden)

      + grant {
          + principal  = "mart_analytics_readers"
          + privileges = [
              + "USE_CATALOG",
            ]
        }

        # (17 unchanged blocks hidden)
    }

  # databricks_grants.mart_schemas["analytics"] will be created
  + resource "databricks_grants" "mart_schemas" {
      + id     = (known after apply)
      + schema = "goodparty_data_catalog.mart_analytics"

      + grant {
          + principal  = "a04e9e24-aac3-4308-9a65-d88fa34e444f"
          + privileges = [
              + "SELECT",
              + "USE_SCHEMA",
            ]
        }
      + grant {
          + principal  = "dbt_developers"
          + privileges = [
              + "SELECT",
              + "USE_SCHEMA",
            ]
        }
      + grant {
          + principal  = "ed920c40-3b7d-42cb-ad32-0b4d5484c117"
          + privileges = [
              + "CREATE_TABLE",
              + "MODIFY",
              + "USE_SCHEMA",
            ]
        }
      + grant {
          + principal  = "mart_analytics_readers"
          + privileges = [
              + "SELECT",
              + "USE_SCHEMA",
            ]
        }
    }

  # databricks_grants.models_mban_schema will be created
  + resource "databricks_grants" "models_mban_schema" {
      + id     = (known after apply)
      + schema = (known after apply)

      + grant {
          + principal  = "mart_mban2026_readers"
          + privileges = [
              + "CREATE_MODEL",
              + "SELECT",
              + "USE_SCHEMA",
            ]
        }
    }

  # databricks_group.mart_readers_account["analytics"] will be created
  + resource "databricks_group" "mart_readers_account" {
      + acl_principal_id           = (known after apply)
      + allow_cluster_create       = false
      + allow_instance_pool_create = false
      + databricks_sql_access      = false
      + display_name               = "mart_analytics_readers"
      + id                         = (known after apply)
      + url                        = (known after apply)
      + workspace_access           = false
      + workspace_consume          = false
    }

  # databricks_group_member.genie_slack_bot_in_genie_civics will be created
  + resource "databricks_group_member" "genie_slack_bot_in_genie_civics" {
      + group_id  = "83477901595081"
      + id        = (known after apply)
      + member_id = "78241571919209"
    }

  # databricks_mws_permission_assignment.mart_readers["analytics"] will be created
  + resource "databricks_mws_permission_assignment" "mart_readers" {
      + id           = (known after apply)
      + permissions  = [
          + "USER",
        ]
      + principal_id = (known after apply)
      + workspace_id = 3578414625112071
    }

  # databricks_permissions.sql_warehouse_starter will be updated in-place
  ~ resource "databricks_permissions" "sql_warehouse_starter" {
        id              = "/sql/warehouses/18583d8b081c6486"
        # (2 unchanged attributes hidden)

      - access_control {
          - permission_level       = "CAN_USE" -> null
          - service_principal_name = "0d945bd8-d62f-4e9f-80bf-e3c40b2ea1ec" -> null
            # (2 unchanged attributes hidden)
        }
      - access_control {
          - group_name             = "users" -> null
          - permission_level       = "CAN_USE" -> null
            # (2 unchanged attributes hidden)
        }
      + access_control {
          + permission_level       = "CAN_USE"
          + service_principal_name = "fd8d8e25-0327-40bd-8199-0c5788dafd00"
            # (2 unchanged attributes hidden)
        }
      + access_control {
          + group_name       = "users"
          + permission_level = "CAN_USE"
        }
      + access_control {
          + permission_level       = "CAN_USE"
          + service_principal_name = "0d945bd8-d62f-4e9f-80bf-e3c40b2ea1ec"
        }
    }

  # databricks_schema.marts["analytics"] will be updated in-place
  ~ resource "databricks_schema" "marts" {
      + comment                        = "Analytics mart for cross-domain business metrics and reporting"
      + force_destroy                  = false
        id                             = "goodparty_data_catalog.mart_analytics"
        name                           = "mart_analytics"
      ~ properties                     = {
          + "managed_by" = "terraform"
          - "owner"      = "root" -> null
          + "purpose"    = "mart"
        }
        # (5 unchanged attributes hidden)
    }

  # databricks_schema.models_mban will be created
  + resource "databricks_schema" "models_mban" {
      + catalog_name                   = "goodparty_data_catalog"
      + comment                        = "Schema for MBAN team ML models and predictions"
      + enable_predictive_optimization = (known after apply)
      + force_destroy                  = false
      + id                             = (known after apply)
      + metastore_id                   = (known after apply)
      + name                           = "models_mban"
      + owner                          = (known after apply)
      + properties                     = {
          + "managed_by" = "terraform"
          + "purpose"    = "models"
        }
      + schema_id                      = (known after apply)
    }

Plan: 6 to add, 3 to change, 0 to destroy.

Changes to Outputs:
  ~ astro_deployments    = {
      ~ dev  = {
            id            = "cml8n1tav1nxs01nd7ptp4tpm"
            name          = "astro-dev"
          ~ webserver_url = "cmgicqn2w002701mqfw3367w2.astronomer.run/dptp4tpm" -> "cml8n1tav1nxs01nd7ptp4tpm.pm.astronomer.run/dptp4tpm"
            # (1 unchanged attribute hidden)
        }
        # (1 unchanged attribute hidden)
    }
  ~ mart_reader_groups   = {
      + analytics = "mart_analytics_readers"
        # (2 unchanged attributes hidden)
    }
```

</details>

---

<details>
<summary>What do these mean?</summary>

- **Create**: New resources will be added
- **Update**: Existing resources will be modified in-place
- **Replace**: Resources will be destroyed and recreated (data loss possible)
- **Destroy**: Resources will be permanently deleted

</details>

---

**To apply these changes:**

1. **Merge** this PR to `main`
2. **Review** the plan in the workflow run triggered by the merge
3. **Deploy** via Actions → Deploy → Run workflow → uncheck "Dry run"

Or via CLI after merge: `gh workflow run deploy.yaml -f dry_run=false`
